wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/acmp_reg.h
/**************************************************************************//**
 * @file     acmp_reg.h
 * @version  V1.00
 * @brief    ACMP register definition header file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

#ifndef __ACMP_REG_H__
#define __ACMP_REG_H__

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/**
   @addtogroup REGISTER Control Register
   @{
*/

/**
    @addtogroup ACMP Analog Comparator Controller (ACMP)
    Memory Mapped Structure for ACMP Controller
    @{
*/

typedef struct
{
/**
 * @var ACMP_T::CTL0
 * Offset: 0x00  Analog Comparator 0 Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ACMPEN    |Comparator Enable Bit
 * |        |          |0 = Comparator 0 Disabled.
 * |        |          |1 = Comparator 0 Enabled.
 * |[1]     |ACMPIE    |Comparator Interrupt Enable Bit
 * |        |          |0 = Comparator 0 interrupt Disabled.
 * |        |          |1 = Comparator 0 interrupt Enabled
 * |        |          |If WKEN (ACMP_CTL0[16]) is set to 1, the wake-up interrupt function will be enabled as well.
 * |[3]     |ACMPOINV  |Comparator Output Inverse
 * |        |          |0 = Comparator 0 output inverse Disabled.
 * |        |          |1 = Comparator 0 output inverse Enabled.
 * |[6:4]   |NEGSEL    |Comparator Negative Input Selection
 * |        |          |000 = ACMP0_N pin.
 * |        |          |001 = Internal comparator reference voltage (CRV0).
 * |        |          |010 = Band-gap voltage.
 * |        |          |011 = DAC0 output.
 * |        |          |100 = DAC1 output.
 * |        |          |Note: NEGSEL must select 0x1 in calibration mode.
 * |[10:8]  |POSSEL    |Comparator Positive Input Selection
 * |        |          |00 = Input from ACMP0_P0.
 * |        |          |01 = Input from ACMP0_P1.
 * |        |          |10 = Input from ACMP0_P2.
 * |        |          |11 = Input from ACMP0_P3.
 * |[12]    |OUTSEL    |Comparator Output Select
 * |        |          |0 = Comparator 0 output to ACMP0_O pin is unfiltered comparator output.
 * |        |          |1 = Comparator 0 output to ACMP0_O pin is from filter output.
 * |[15:13] |FILTSEL   |Comparator Output Filter Count Selection
 * |        |          |000 = Filter function is Disabled.
 * |        |          |001 = ACMP0 output is sampled 1 consecutive PCLK.
 * |        |          |010 = ACMP0 output is sampled 2 consecutive PCLKs.
 * |        |          |011 = ACMP0 output is sampled 4 consecutive PCLKs.
 * |        |          |100 = ACMP0 output is sampled 8 consecutive PCLKs.
 * |        |          |101 = ACMP0 output is sampled 16 consecutive PCLKs.
 * |        |          |110 = ACMP0 output is sampled 32 consecutive PCLKs.
 * |        |          |111 = ACMP0 output is sampled 64 consecutive PCLKs.
 * |[16]    |WKEN      |Power-down Wake-up Enable Bit
 * |        |          |0 = Wake-up function Disabled.
 * |        |          |1 = Wake-up function Enabled.
 * |[17]    |WLATEN    |Window Latch Mode Enable Bit
 * |        |          |0 = Window Latch Mode Disabled.
 * |        |          |1 = Window Latch Mode Enabled.
 * |[18]    |WCMPSEL   |Window Compare Mode Selection
 * |        |          |0 = Window Compare Mode Disabled.
 * |        |          |1 = Window Compare Mode is Selected.
 * |[21:20] |FCLKDIV   |Comparator Output Filter Clock Divider
 * |        |          |00 = cComparator output filter clock = PCLK
 * |        |          |01 = cComparator output filter clock = PCLK/2
 * |        |          |10 = cComparator output filter clock = PCLK/4
 * |        |          |11 = Reserved
 * |        |          |Note: Use FCLKDIV under the condition of FILTSEL = 3'h7, then set FCLKDIV to get the effect of filtering 128,256 consecutive PCLKs.
 * |[26:24] |HYSSEL    |Hysteresis Mode Selection
 * |        |          |000 = Hysteresis is 0mV.
 * |        |          |001 = Hysteresis is 10mV.
 * |        |          |010 = Hysteresis is 20mV.
 * |        |          |011 = Hysteresis is 30mV.
 * |        |          |100 = Hysteresis is 40mV
 * |        |          |101 = Hysteresis is 50mV
 * |        |          |Others = rReserved
 * |[29:28] |MODESEL   |Comparator Power Mode Selection
 * |        |          |00 = low power mode comparator AVDD current 1uA
 * |        |          |01 = low power mode comparator AVDD current 2uA
 * |        |          |10 = active mode comparator AVDD current 35uA
 * |        |          |11 = active mode comparator AVDD current 70uA
 * |[31:30] |INTPOL    |Interrupt Condition Polarity Selection
 * |        |          |ACMPIF0 will be set to 1 when comparator output edge condition is detected.
 * |        |          |00 = Rising edge or falling edge.
 * |        |          |01 = Rising edge.
 * |        |          |10 = Falling edge.
 * |        |          |11 = Reserved.
 * @var ACMP_T::CTL1
 * Offset: 0x04  Analog Comparator 1 Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ACMPEN    |Comparator Enable Bit
 * |        |          |0 = Comparator 1 Disabled.
 * |        |          |1 = Comparator 1 Enabled.
 * |[1]     |ACMPIE    |Comparator Interrupt Enable Bit
 * |        |          |0 = Comparator 1 interrupt Disabled.
 * |        |          |1 = Comparator 1 interrupt Enabled
 * |        |          |If WKEN (ACMP_CTL0[16]) is set to 1, the wake-up interrupt function will be enabled as well.
 * |[3]     |ACMPOINV  |Comparator Output Inverse
 * |        |          |0 = Comparator 1 output inverse Disabled.
 * |        |          |1 = Comparator 1 output inverse Enabled.
 * |[6:4]   |NEGSEL    |Comparator Negative Input Selection
 * |        |          |000 = ACMP1_N pin.
 * |        |          |001 = Internal comparator reference voltage (CRV1).
 * |        |          |010 = Band-gap voltage.
 * |        |          |011 = DAC0 output.
 * |        |          |100 = DAC1 output.
 * |        |          |Note: NEGSEL must select 0x1 in calibration mode.
 * |[10:8]  |POSSEL    |Comparator Positive Input Selection
 * |        |          |00 = Input from ACMP1_P0.
 * |        |          |01 = Input from ACMP1_P1.
 * |        |          |10 = Input from ACMP1_P2.
 * |        |          |11 = Input from ACMP1_P3.
 * |[12]    |OUTSEL    |Comparator Output Select
 * |        |          |0 = Comparator 1 output to ACMP1_O pin is unfiltered comparator output.
 * |        |          |1 = Comparator 1 output to ACMP1_O pin is from filter output.
 * |[15:13] |FILTSEL   |Comparator Output Filter Count Selection
 * |        |          |000 = Filter function is Disabled.
 * |        |          |001 = ACMP1 output is sampled 1 consecutive PCLK.
 * |        |          |010 = ACMP1 output is sampled 2 consecutive PCLKs.
 * |        |          |011 = ACMP1 output is sampled 4 consecutive PCLKs.
 * |        |          |100 = ACMP1 output is sampled 8 consecutive PCLKs.
 * |        |          |101 = ACMP1 output is sampled 16 consecutive PCLKs.
 * |        |          |110 = ACMP1 output is sampled 32 consecutive PCLKs.
 * |        |          |111 = ACMP1 output is sampled 64 consecutive PCLKs.
 * |[16]    |WKEN      |Power-down Wake-up Enable Bit
 * |        |          |0 = Wake-up function Disabled.
 * |        |          |1 = Wake-up function Enabled.
 * |[17]    |WLATEN    |Window Latch Mode Enable Bit
 * |        |          |0 = Window Latch Mode Disabled.
 * |        |          |1 = Window Latch Mode Enabled.
 * |[18]    |WCMPSEL   |Window Compare Mode Selection
 * |        |          |0 = Window Compare Mode Disabled.
 * |        |          |1 = Window Compare Mode is Selected.
 * |[21:20] |FCLKDIV   |Comparator Output Filter Clock Divider
 * |        |          |00 = Comparator output filter clock = PCLK
 * |        |          |01 = Comparator output filter clock = PCLK/2
 * |        |          |10 = Comparator output filter clock = PCLK/4
 * |        |          |11 = Reserved
 * |        |          |Note: Use FCLKDIV under the condition of FILTSEL = 3'h7, then set FCLKDIV to get the effect of filtering 128,256 consecutive PCLKs.
 * |[26:24] |HYSSEL    |Hysteresis Mode Selection
 * |        |          |000 = Hysteresis is 0mV.
 * |        |          |001 = Hysteresis is 10mV.
 * |        |          |010 = Hysteresis is 20mV.
 * |        |          |011 = Hysteresis is 30mV.
 * |        |          |100 = Hysteresis is 40mV
 * |        |          |101 = Hysteresis is 50mV
 * |        |          |Others = rReserved
 * |[29:28] |MODESEL   |Comparator Power Mode Selection
 * |        |          |00 = low power mode comparator AVDD current 1uA
 * |        |          |01 = low power mode comparator AVDD current 2uA
 * |        |          |10 = active mode comparator AVDD current 35uA
 * |        |          |11 = active mode comparator AVDD current 70uA
 * |[31:30] |INTPOL    |Interrupt Condition Polarity Selection
 * |        |          |ACMPIF1 will be set to 1 when comparator output edge condition is detected.
 * |        |          |00 = Rising edge or falling edge.
 * |        |          |01 = Rising edge.
 * |        |          |10 = Falling edge.
 * |        |          |11 = Reserved.
 * @var ACMP_T::STATUS
 * Offset: 0x08  Analog Comparator 01 Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ACMPIF0   |Comparator 0 Interrupt Flag
 * |        |          |This bit is set by hardware when the edge condition defined by INTPOL (ACMP_CTL0[31:30]) is detected on comparator 0 output
 * |        |          |This will generate an interrupt if ACMPIE (ACMP_CTL0[1]) is set to 1.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[1]     |ACMPIF1   |Comparator 1 Interrupt Flag
 * |        |          |This bit is set by hardware when the edge condition defined by INTPOL (ACMP_CTL1[31:30]) is detected on comparator 1 output
 * |        |          |This will cause an interrupt if ACMPIE (ACMP_CTL1[1]) is set to 1.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[4]     |ACMPO0    |Comparator 0 Output
 * |        |          |Synchronized to the PCLK to allow reading by software
 * |        |          |Cleared when the comparator 0 is disabled, i.e
 * |        |          |ACMPEN (ACMP_CTL0[0]) is cleared to 0.
 * |[5]     |ACMPO1    |Comparator 1 Output
 * |        |          |Synchronized to the PCLK to allow reading by software
 * |        |          |Cleared when the comparator 1 is disabled, i.e
 * |        |          |ACMPEN (ACMP_CTL1[0]) is cleared to 0.
 * |[8]     |WKIF0     |Comparator 0 Power-down Wake-up Interrupt Flag
 * |        |          |This bit will be set to 1 when ACMP0 wake-up interrupt event occurs.
 * |        |          |0 = No power-down wake-up occurred.
 * |        |          |1 = Power-down wake-up occurred.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[9]     |WKIF1     |Comparator 1 Power-down Wake-up Interrupt Flag
 * |        |          |This bit will be set to 1 when ACMP1 wake-up interrupt event occurs.
 * |        |          |0 = No power-down wake-up occurred.
 * |        |          |1 = Power-down wake-up occurred.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[12]    |ACMPS0    |Comparator 0 Status
 * |        |          |Synchronized to the PCLK to allow reading by software
 * |        |          |Cleared when the comparator 0 is disabled, i.e
 * |        |          |ACMPEN (ACMP_CTL0[0]) is cleared to 0.
 * |[13]    |ACMPS1    |Comparator 1 Status
 * |        |          |Synchronized to the PCLK to allow reading by software
 * |        |          |Cleared when the comparator 1 is disabled, i.e
 * |        |          |ACMPEN (ACMP_CTL1[0]) is cleared to 0.
 * |[16]    |ACMPWO    |Comparator Window Output
 * |        |          |This bit shows the output status of window compare mode
 * |        |          |0 = The positive input voltage is outside the window.
 * |        |          |1 = The positive input voltage is in the window.
 * @var ACMP_T::VREF
 * Offset: 0x0C  Analog Comparator 01 Reference Voltage Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[5:0]   |CRV0SEL   |Comparator0Comparator 0 Reference Voltage Setting
 * |        |          |CRV0 = CRV0 source voltage * (ACMP_VREF[5:0] )/ 63.
 * |[6]     |CRV0SSEL  |CRV0 Source Voltage Selection
 * |        |          |0 = AVDD is selected as CRV0 source voltage.
 * |        |          |1 = The reference voltage defined by SYS_VREFCTL register is selected as CRV0 source voltage.
 * |[8]     |CRV0EN    |CRV0 Enable Bit
 * |        |          |0 = CRV0 is Disabled.
 * |        |          |1 = CRV0 is Enabled.
 * |[21:16] |CRV1SEL   |Comparator1Comparator 1 Reference Voltage Setting
 * |        |          |CRV1 = CRV1 source voltage * (ACMP_VREF[21:16] )/ 63.
 * |[22]    |CRV1SSEL  |CRV1 Source Voltage Selection
 * |        |          |0 = AVDD is selected as CRV1 source voltage.
 * |        |          |1 = The reference voltage defined by SYS_VREFCTL register is selected as CRV1 source voltage.
 * |[24]    |CRV1EN    |CRV1 Enable Bit
 * |        |          |0 = CRV1 is Disabled.
 * |        |          |1 = CRV1 is Enabled.
 * @var ACMP_T::CALCTL
 * Offset: 0x10  Analog Comparator 01 Calibration Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CALTRG0   |Comparator0Comparator 0 Calibration Trigger Bit
 * |        |          |0 = Calibration is stopped.
 * |        |          |1 = Calibration is triggered.
 * |        |          |Note 1: Before this bit is enabled, ACMPEN(ACMP_CTL0[0]) should be set and the internal high speed RC oscillator (HIRC) should be enabled in advance.
 * |        |          |Note 2: Hardware will auto clear this bit when the next calibration is triggered by software.
 * |        |          |Note 3: If user must trigger calibration twice or more times, the second trigger haves to wait at least 300us after the previous calibration is done.
 * |[1]     |CALTRG1   |Comparator1Comparator 1 Calibration Trigger Bit
 * |        |          |0 = Calibration is stopped.
 * |        |          |1 = Calibration is triggered.
 * |        |          |Note 1: Before this bit is enabled, ACMPEN(ACMP_CTL1[0]) should be set and the internal high speed RC oscillator (HIRC) should be enabled in advance.
 * |        |          |Note 2: Hardware will auto clear this bit when the next calibration is triggered by software.
 * |        |          |Note 3: If user must trigger calibration twice or more times, the second trigger haves to wait at least 300us after the previous calibration is done.
 * |[5:4]   |CALCLK0   |Comparator0Comparator 0 Calibration Clock Rate Selection
 * |        |          |00 = 1.5 kHz.
 * |        |          |01 = 6 kHz.
 * |        |          |10 = 24kHz.
 * |        |          |11 = 95 kHz.
 * |[7:6]   |CALCLK1   |Comparator1Comparator 1 Calibration Clock Rate Selection
 * |        |          |00 = 1.5 kHz.
 * |        |          |01 = 6 kHz.
 * |        |          |10 = 24kHz.
 * |        |          |11 = 95 kHz.
 * |[8]     |OFFSETSEL |Comparator Trim Code Selection
 * |        |          |0 = calibration trim code will not minus 1 when calibrated done.
 * |        |          |1 = calibration trim code will not minus 1 when calibrated done.
 * |[17:16] |CALRVS    |Calibration Reference Voltage Selection
 * |        |          |00 = option0 (N-pair calibration: 5V - 80mV, P-pair calibration: 80mV)
 * |        |          |01 = option1
 * |        |          |10 = option2 (N-pair calibration: 5V - 160mV, P-pair calibration: 160mV)
 * |        |          |11 = Reserved
 * |        |          |Note: CRV0 and CRV1 must be the same setting in calibration
 * |        |          |Note: The details refer to Analog ACMP SPEC
 * @var ACMP_T::CALSTS
 * Offset: 0x14  Analog Comparator 01 Calibration Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |DONE0     |Comparator 0 Calibration Done Status
 * |        |          |0 = Calibrating.
 * |        |          |1 = Calibration done.
 * |        |          |NOTE: this bit is write 1 clear
 * |[4]     |DONE1     |Comparator 1 Calibration Done Status
 * |        |          |0 = Calibrating.
 * |        |          |1 = Calibration done.
 * |        |          |NOTE: this bit is write 1 clear
 * @var ACMP_T::COFF
 * Offset: 0xFF0  Analog Comparator 01 Calibration Offset Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |NCODE0    |Comparator0Comparator 0 Offset of NMOS
 * |        |          |ACMP0 offset canceling trim code of NMOS
 * |        |          |Note: 1. Once ACMP0 is enabled, reading these bits will gets initial value from ROMMAP46[19:16]
 * |        |          |2. write MODESEL ACMP_CTL0[29:28] will decide NCODE0 load from which ROMMAP
 * |        |          | MODESEL = 2'b00, NCODE0 load from ROMMAP46[3:0]
 * |        |          | MODESEL = 2'b01, NCODE0 load from ROMMAP46[19:16]
 * |        |          | MODESEL = 2'b10, NCODE0 load from ROMMAP47[3:0]
 * |        |          | MODESEL = 2'b11, NCODE0 load from ROMMAP47[19:16]
 * |[7]     |NSEL0     |Comparator0Comparator 0 Offset of NMOS
 * |        |          |0 = trim NMOS negative offset
 * |        |          |1 = trim NMOS positive offset
 * |        |          |Note: 1. Once ACMP0 is enabled, reading this bit default will get initial value from ROMMAP46[20]
 * |        |          | 2. write MODESEL ACMP_CTL0[29:28] will decide NSEL0 load from which ROMMAP
 * |        |          | MODESEL = 2'b00, NSEL0 load from ROMMAP46[4]
 * |        |          | MODESEL = 2'b01, NSEL0 load from ROMMAP46[20]
 * |        |          | MODESEL = 2'b10, NSEL0 load from ROMMAP47[4]
 * |        |          | MODESEL = 2'b11, NSEL0 load from ROMMAP47[20]
 * |        |          |2
 * |        |          |If ACMP0 is enabled and CALTRG0 (ACMP_CALCTL01[0]]) is set, after calibration done DONE0(ACMP_CALSRTS01[0]) will get NSEL0 value
 * |[11:8]  |PCODE0    |Comparator0Comparator 0 Offset of PMOS
 * |        |          |ACMP0 offset canceling trim code of PMOS
 * |        |          |Note: 1. Once ACMP0 is enabled, reading these bits default will get initial value from ROMMAP46[27:24]
 * |        |          |2. write MODESEL ACMP_CTL0[29:28] will decide PCODE0 load from which ROMMAP
 * |        |          | MODESEL =2'b00, PCODE0 load from ROMMAP46[11:8]
 * |        |          | MODESEL =2'b01, PCODE0 load from ROMMAP46[27:24]
 * |        |          | MODESEL =2'b10, PCODE0 load from ROMMAP47[11:8]
 * |        |          | MODESEL =2'b11, PCODE0 load from ROMMAP47[27:24]
 * |[15]    |PSEL0     |Comparator0Comparator 0 Offset of PMOS
 * |        |          |0 = trim PMOS negative offset
 * |        |          |1 = trim PMOS positive offset
 * |        |          |Note: 1. Once ACMP0 is enabled, reading this bit default will get initial value from ROMMAP46[28].
 * |        |          |2. write MODESEL ACMP_CTL0[29:28] will decide PSEL0 load from which ROMMAP
 * |        |          | MODESEL = 2'b00, PSEL0 load from ROMMAP46[12]
 * |        |          | MODESEL = 2'b01, PSEL0 load from ROMMAP48[28]
 * |        |          | MODESEL = 2'b10, PSEL0 load from ROMMAP47[12]
 * |        |          | MODESEL = 2'b11, PSEL0 load from ROMMAP47[28]
 * |        |          |3
 * |        |          |If ACMP0 is enabled and CALTRG0 (ACMP_CALCTL01[0]]) is set, after calibration done DONE0(ACMP_CALSACMP_CALSTS01R[0]) will get PSEL0 value
 * |[19:16] |NCODE1    |Comparator 1 Offset of NMOS
 * |        |          |ACMP1 offset canceling trim code of PMOS
 * |        |          |Note: 1. Once ACMP1 is enabled, reading these bits default will get initial value from ROMMAP48[19:16]
 * |        |          |2. write MODESEL ACMP_CTL1[29:28] will decide NCODE1 load from which ROMMAP
 * |        |          | MODESEL =  2'b00, NCODE1load from ROMMAP48[3:0]
 * |        |          | MODESEL =  2'b01, NCODE1 load from ROMMAP48[19:16]
 * |        |          | MODESEL =  2'b10, NCODE1 load from ROMMAP49[3:0]
 * |        |          | MODESEL =  2'b11, NCODE1 load from ROMMAP49[19:16]
 * |[23]    |NSEL1     |Comparator 1 Offset of NMOS
 * |        |          |0 = trim NMOS negative offset
 * |        |          |1 = trim NMOS positive offset
 * |        |          |Note: 1. Once ACMP1 is enabled, reading this bit default will get initial value from ROMMAP48[20]
 * |        |          | 2. write MODESEL ACMP_CTL1[29:28] will decide NSEL1 load from which ROMMAP
 * |        |          | MODESEL =  2'b00, NSEL1 load from ROMMAP48[4]
 * |        |          | MODESEL =  2'b01, NSEL1 load from ROMMAP48[20]
 * |        |          | MODESEL =  2'b10, NSEL1 load from ROMMAP49[4]
 * |        |          | MODESEL =  2'b11, NSEL1 load from ROMMAP49[20]
 * |        |          |3
 * |        |          |If ACMP1 is enabled and CALTRG1 (ACMP_CALCTL01[1]]) is set, after calibration done DONE1(ACMP_CALSRTS01[4]) will get NSEL1 value
 * |[27:24] |PCODE1    |Comparator 1 Offset of PMOS
 * |        |          |ACMP1 offset canceling trim code of PMOS
 * |        |          |Note: 1. Once ACMP1 is enabled, reading these bits default will get initial value from ROMMAP48[27:24]
 * |        |          |2. write MODESEL ACMP_CTL1[29:28] will decide PCODE1 load from which ROMMAP
 * |        |          | MODESEL = 2'b00, PCODE1 load from ROMMAP48[11:8]
 * |        |          | MODESEL = 2'b01, PCODE1 load from ROMMAP48[27:24]
 * |        |          | MODESEL = 2'b10, PCODE1 load from ROMMAP49[11:8]
 * |        |          | MODESEL = 2'b11, PCODE1 load from ROMMAP49[27:24]
 * |[31]    |PSEL1     |Comparator 1 Offset of PMOS
 * |        |          |0 = trim PMOS negative offset
 * |        |          |1 = trim PMOS positive offset
 * |        |          |Note: 1. Once ACMP1 is enabled, reading this bit default will get initial value from ROMMAP48[28]
 * |        |          | 2. write MODESEL ACMP_CTL1[29:28] will decide PSEL1 load from which ROMMAP
 * |        |          | MODESEL =  2'b00, PSEL1 load from ROMMAP48[12]
 * |        |          | MODESEL =  2'b01, PSEL1 load from ROMMAP48[28]
 * |        |          | MODESEL =  2'b10, PSEL1 load from ROMMAP49[12]
 * |        |          | MODESEL =  2'b11, PSEL1 load from ROMMAP49[28]
 * |        |          |3.If ACMP1 is enabled and CALTRG1 (ACMP_CALCTL01[1]]) is set, after calibration done DONE1(ACMP_CALSRTS01[4]) will get PSEL1 value
 * @var ACMP_T::TEST
 * Offset: 0xFF8  Analog Comparator 01 Test Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |CRV0TEST  |CRV0 Test Mode Enable Bit (Write Protect)
 * |        |          |0 = No effect.
 * |        |          |1 = CRV voltage output to ACMP0_N pin for voltage measure.
 * |        |          |This bit is designed for Nuvoton Lab use only.
