wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/acmp_reg.h
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
 * |        |          |Note: NEGSEL (ACMP_CTL0[6:4]) or NEGSEL (ACMP_CTL1[6:4]) must select to 2'b01 in CRV test mode
 * |[1]     |CRV1TEST  |CRV1 Test Mode Enable Bit (Write Protect)
 * |        |          |0 = No effect.
 * |        |          |1 = CRV voltage output to ACMP0_N pin for voltage measure.
 * |        |          |This bit is designed for Nuvoton Lab use only.
 * |        |          |Note: This bit is write protected. Refer to the SYS_REGLCTL register.
 * |        |          |Note: NEGSEL (ACMP_CTL0[6:4]) or NEGSEL (ACMP_CTL1[6:4]) must select to 2'b01 in CRV test mode
 * |[4]     |OUTSEL    |Comparator CRV Output Source Selection
 * |        |          |0 = CRV output from resistor string
 * |        |          |1 = CRV output from bandgap voltage
 * |[8]     |HYSBYPASS |Hysteresis Adjust Function Selection
 * |        |          |0 = Enable adjust function
 * |        |          |1 = Bypass adjust function
 * @var ACMP_T::VERSION
 * Offset: 0xFFC  Analog Comparator RTL Design Version Number
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |MINOR     |Comp RTL Design MINOR Version Number
 * |        |          |Minor version number is dependent on module ECO version control.
 * |[23:16] |SUB       |Comp RTL Design SUB Version Number
 * |        |          |Major version number is correlated to Product Line.
 * |[31:24] |MAJOR     |Comp RTL Design MAJOR Version Number
 * |        |          |Major version number is correlated to Product Line.
 */
    __IO uint32_t CTL[2];           /*!< [0x00-004] Analog Comparator 0/1/2/3 Control Register          */
    __IO uint32_t STATUS;           /*!< [0x08] Analog Comparator Status Register                       */
    __IO uint32_t VREF;             /*!< [0x0C] Analog Comparator Reference Voltage Control Register    */
    __IO uint32_t CALCTL;           /*!< [0x10] Analog Comparator Calibration Control Register          */
    __IO uint32_t CALSR;            /*!< [0x14] Analog Comparator Calibration Status Register           */
    __I  uint32_t RESERVE0[1014];
    __IO uint32_t COFF;             /*!< [0xFF0] Analog Comparator Calibration Offset Register          */
     __I  uint32_t RESERVE1[1];
    __IO uint32_t TEST;             /*!< [0xFF8] Analog Comparator Test Control Register                */
    __I  uint32_t VERSION;          /*!< [0xFFC] Analog Comparator RTL Design Version Number            */
} ACMP_T;

/**
    @addtogroup ACMP_CONST ACMP Bit Field Definition
    Constant Definitions for ACMP Controller
@{ */

#define ACMP_CTL_ACMPEN_Pos             (0)                                         /*!< ACMP_T::CTL: ACMPEN Position               */
#define ACMP_CTL_ACMPEN_Msk             (0x1UL << ACMP_CTL_ACMPEN_Pos)              /*!< ACMP_T::CTL: ACMPEN Mask                   */

#define ACMP_CTL_ACMPIE_Pos             (1)                                         /*!< ACMP_T::CTL: ACMPIE Position               */
#define ACMP_CTL_ACMPIE_Msk             (0x1UL << ACMP_CTL_ACMPIE_Pos)              /*!< ACMP_T::CTL: ACMPIE Mask                   */

#define ACMP_CTL_ACMPOINV_Pos           (3)                                         /*!< ACMP_T::CTL: ACMPOINV Position             */
#define ACMP_CTL_ACMPOINV_Msk           (0x1UL << ACMP_CTL_ACMPOINV_Pos)            /*!< ACMP_T::CTL: ACMPOINV Mask                 */

#define ACMP_CTL_NEGSEL_Pos             (4)                                         /*!< ACMP_T::CTL: NEGSEL Position               */
#define ACMP_CTL_NEGSEL_Msk             (0x7UL << ACMP_CTL_NEGSEL_Pos)              /*!< ACMP_T::CTL: NEGSEL Mask                   */

#define ACMP_CTL_POSSEL_Pos             (8)                                         /*!< ACMP_T::CTL: POSSEL Position               */
#define ACMP_CTL_POSSEL_Msk             (0x7UL << ACMP_CTL_POSSEL_Pos)              /*!< ACMP_T::CTL: POSSEL Mask                   */

#define ACMP_CTL_OUTSEL_Pos             (12)                                        /*!< ACMP_T::CTL: OUTSEL Position               */
#define ACMP_CTL_OUTSEL_Msk             (0x1UL << ACMP_CTL_OUTSEL_Pos)              /*!< ACMP_T::CTL: OUTSEL Mask                   */

#define ACMP_CTL_FILTSEL_Pos            (13)                                        /*!< ACMP_T::CTL: FILTSEL Position              */
#define ACMP_CTL_FILTSEL_Msk            (0x7UL << ACMP_CTL_FILTSEL_Pos)             /*!< ACMP_T::CTL: FILTSEL Mask                  */

#define ACMP_CTL_WKEN_Pos               (16)                                        /*!< ACMP_T::CTL: WKEN Position                 */
#define ACMP_CTL_WKEN_Msk               (0x1UL << ACMP_CTL_WKEN_Pos)                /*!< ACMP_T::CTL: WKEN Mask                     */

#define ACMP_CTL_WLATEN_Pos             (17)                                        /*!< ACMP_T::CTL: WLATEN Position               */
#define ACMP_CTL_WLATEN_Msk             (0x1UL << ACMP_CTL_WLATEN_Pos)              /*!< ACMP_T::CTL: WLATEN Mask                   */

#define ACMP_CTL_WCMPSEL_Pos            (18)                                        /*!< ACMP_T::CTL: WCMPSEL Position              */
#define ACMP_CTL_WCMPSEL_Msk            (0x1UL << ACMP_CTL_WCMPSEL_Pos)             /*!< ACMP_T::CTL: WCMPSEL Mask                  */

#define ACMP_CTL_FCLKDIV_Pos            (20)                                        /*!< ACMP_T::CTL: FCLKDIV Position              */
#define ACMP_CTL_FCLKDIV_Msk            (0x3UL << ACMP_CTL_FCLKDIV_Pos)             /*!< ACMP_T::CTL: FCLKDIV Mask                  */

#define ACMP_CTL_HYSSEL_Pos             (24)                                        /*!< ACMP_T::CTL: HYSSEL Position               */
#define ACMP_CTL_HYSSEL_Msk             (0x7UL << ACMP_CTL_HYSSEL_Pos)              /*!< ACMP_T::CTL: HYSSEL Mask                   */

#define ACMP_CTL_MODESEL_Pos            (28)                                        /*!< ACMP_T::CTL: MODESEL Position              */
#define ACMP_CTL_MODESEL_Msk            (0x3UL << ACMP_CTL_MODESEL_Pos)             /*!< ACMP_T::CTL: MODESEL Mask                  */

#define ACMP_CTL_INTPOL_Pos             (30)                                        /*!< ACMP_T::CTL: INTPOL Position               */
#define ACMP_CTL_INTPOL_Msk             (0x3UL << ACMP_CTL_INTPOL_Pos)              /*!< ACMP_T::CTL: INTPOL Mask                   */

#define ACMP_STATUS_ACMPIF0_Pos         (0)                                         /*!< ACMP_T::STATUS: ACMPIF0 Position           */
#define ACMP_STATUS_ACMPIF0_Msk         (0x1UL << ACMP_STATUS_ACMPIF0_Pos)          /*!< ACMP_T::STATUS: ACMPIF0 Mask               */

#define ACMP_STATUS_ACMPIF1_Pos         (1)                                         /*!< ACMP_T::STATUS: ACMPIF1 Position           */
#define ACMP_STATUS_ACMPIF1_Msk         (0x1UL << ACMP_STATUS_ACMPIF1_Pos)          /*!< ACMP_T::STATUS: ACMPIF1 Mask               */

#define ACMP_STATUS_ACMPO0_Pos          (4)                                         /*!< ACMP_T::STATUS: ACMPO0 Position            */
#define ACMP_STATUS_ACMPO0_Msk          (0x1UL << ACMP_STATUS_ACMPO0_Pos)           /*!< ACMP_T::STATUS: ACMPO0 Mask                */

#define ACMP_STATUS_ACMPO1_Pos          (5)                                         /*!< ACMP_T::STATUS: ACMPO1 Position            */
#define ACMP_STATUS_ACMPO1_Msk          (0x1UL << ACMP_STATUS_ACMPO1_Pos)           /*!< ACMP_T::STATUS: ACMPO1 Mask                */

#define ACMP_STATUS_WKIF0_Pos           (8)                                         /*!< ACMP_T::STATUS: WKIF0 Position             */
#define ACMP_STATUS_WKIF0_Msk           (0x1UL << ACMP_STATUS_WKIF0_Pos)            /*!< ACMP_T::STATUS: WKIF0 Mask                 */

#define ACMP_STATUS_WKIF1_Pos           (9)                                         /*!< ACMP_T::STATUS: WKIF1 Position             */
#define ACMP_STATUS_WKIF1_Msk           (0x1UL << ACMP_STATUS_WKIF1_Pos)            /*!< ACMP_T::STATUS: WKIF1 Mask                 */

#define ACMP_STATUS_ACMPS0_Pos          (12)                                        /*!< ACMP_T::STATUS: ACMPS0 Position            */
#define ACMP_STATUS_ACMPS0_Msk          (0x1UL << ACMP_STATUS_ACMPS0_Pos)           /*!< ACMP_T::STATUS: ACMPS0 Mask                */

#define ACMP_STATUS_ACMPS1_Pos          (13)                                        /*!< ACMP_T::STATUS: ACMPS1 Position            */
#define ACMP_STATUS_ACMPS1_Msk          (0x1UL << ACMP_STATUS_ACMPS1_Pos)           /*!< ACMP_T::STATUS: ACMPS1 Mask                */

#define ACMP_STATUS_ACMPWO_Pos          (16)                                        /*!< ACMP_T::STATUS: ACMPWO Position            */
#define ACMP_STATUS_ACMPWO_Msk          (0x1UL << ACMP_STATUS_ACMPWO_Pos)           /*!< ACMP_T::STATUS: ACMPWO Mask                */

#define ACMP_VREF_CRV0SEL_Pos           (0)                                         /*!< ACMP_T::VREF: CRV0SEL Position             */
#define ACMP_VREF_CRV0SEL_Msk           (0x3fUL << ACMP_VREF_CRV0SEL_Pos)           /*!< ACMP_T::VREF: CRV0SEL Mask                 */

#define ACMP_VREF_CRV0SSEL_Pos          (6)                                         /*!< ACMP_T::VREF: CRV0SSEL Position            */
#define ACMP_VREF_CRV0SSEL_Msk          (0x1UL << ACMP_VREF_CRV0SSEL_Pos)           /*!< ACMP_T::VREF: CRV0SSEL Mask                */

#define ACMP_VREF_CRV0EN_Pos            (8)                                         /*!< ACMP_T::VREF: CRV0EN Position              */
#define ACMP_VREF_CRV0EN_Msk            (0x1UL << ACMP_VREF_CRV0EN_Pos)             /*!< ACMP_T::VREF: CRV0EN Mask                  */

#define ACMP_VREF_CRV1SEL_Pos           (16)                                        /*!< ACMP_T::VREF: CRV1SEL Position             */
#define ACMP_VREF_CRV1SEL_Msk           (0x3fUL << ACMP_VREF_CRV1SEL_Pos)           /*!< ACMP_T::VREF: CRV1SEL Mask                 */

#define ACMP_VREF_CRV1SSEL_Pos          (22)                                        /*!< ACMP_T::VREF: CRV1SSEL Position            */
#define ACMP_VREF_CRV1SSEL_Msk          (0x1UL << ACMP_VREF_CRV1SSEL_Pos)           /*!< ACMP_T::VREF: CRV1SSEL Mask                */

