wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/acmp_reg.h
#define ACMP_VREF_CRV1EN_Pos            (24)                                        /*!< ACMP_T::VREF: CRV1EN Position              */
#define ACMP_VREF_CRV1EN_Msk            (0x1UL << ACMP_VREF_CRV1EN_Pos)             /*!< ACMP_T::VREF: CRV1EN Mask                  */

#define ACMP_CALCTL_CALTRG0_Pos         (0)                                         /*!< ACMP_T::CALCTL: CALTRG0 Position           */
#define ACMP_CALCTL_CALTRG0_Msk         (0x1UL << ACMP_CALCTL_CALTRG0_Pos)          /*!< ACMP_T::CALCTL: CALTRG0 Mask               */

#define ACMP_CALCTL_CALTRG1_Pos         (1)                                         /*!< ACMP_T::CALCTL: CALTRG1 Position           */
#define ACMP_CALCTL_CALTRG1_Msk         (0x1UL << ACMP_CALCTL_CALTRG1_Pos)          /*!< ACMP_T::CALCTL: CALTRG1 Mask               */

#define ACMP_CALCTL_CALCLK0_Pos         (4)                                         /*!< ACMP_T::CALCTL: CALCLK0 Position           */
#define ACMP_CALCTL_CALCLK0_Msk         (0x3UL << ACMP_CALCTL_CALCLK0_Pos)          /*!< ACMP_T::CALCTL: CALCLK0 Mask               */

#define ACMP_CALCTL_CALCLK1_Pos         (6)                                         /*!< ACMP_T::CALCTL: CALCLK1 Position           */
#define ACMP_CALCTL_CALCLK1_Msk         (0x3UL << ACMP_CALCTL_CALCLK1_Pos)          /*!< ACMP_T::CALCTL: CALCLK1 Mask               */

#define ACMP_CALCTL_OFFSETSEL_Pos       (8)                                         /*!< ACMP_T::CALCTL: OFFSETSEL Position         */
#define ACMP_CALCTL_OFFSETSEL_Msk       (0x1UL << ACMP_CALCTL_OFFSETSEL_Pos)        /*!< ACMP_T::CALCTL: OFFSETSEL Mask             */

#define ACMP_CALCTL_CALRVS_Pos          (16)                                        /*!< ACMP_T::CALCTL: CALRVS Position            */
#define ACMP_CALCTL_CALRVS_Msk          (0x3UL << ACMP_CALCTL_CALRVS_Pos)           /*!< ACMP_T::CALCTL: CALRVS Mask                */

#define ACMP_CALSR_DONE0_Pos            (0)                                         /*!< ACMP_T::CALSR: DONE0 Position              */
#define ACMP_CALSR_DONE0_Msk            (0x1UL << ACMP_CALSR_DONE0_Pos)             /*!< ACMP_T::CALSR: DONE0 Mask                  */

#define ACMP_CALSR_DONE1_Pos            (4)                                         /*!< ACMP_T::CALSR: DONE1 Position              */
#define ACMP_CALSR_DONE1_Msk            (0x1UL << ACMP_CALSR_DONE1_Pos)             /*!< ACMP_T::CALSR: DONE1 Mask                  */

#define ACMP_COFF_NCODE0_Pos            (0)                                         /*!< ACMP_T::COFF: NCODE0 Position              */
#define ACMP_COFF_NCODE0_Msk            (0xfUL << ACMP_COFF_NCODE0_Pos)             /*!< ACMP_T::COFF: NCODE0 Mask                  */

#define ACMP_COFF_NSEL0_Pos             (7)                                         /*!< ACMP_T::COFF: NSEL0 Position               */
#define ACMP_COFF_NSEL0_Msk             (0x1UL << ACMP_COFF_NSEL0_Pos)              /*!< ACMP_T::COFF: NSEL0 Mask                   */

#define ACMP_COFF_PCODE0_Pos            (8)                                         /*!< ACMP_T::COFF: PCODE0 Position              */
#define ACMP_COFF_PCODE0_Msk            (0xfUL << ACMP_COFF_PCODE0_Pos)             /*!< ACMP_T::COFF: PCODE0 Mask                  */

#define ACMP_COFF_PSEL0_Pos             (15)                                        /*!< ACMP_T::COFF: PSEL0 Position               */
#define ACMP_COFF_PSEL0_Msk             (0x1UL << ACMP_COFF_PSEL0_Pos)              /*!< ACMP_T::COFF: PSEL0 Mask                   */

#define ACMP_COFF_NCODE1_Pos            (16)                                        /*!< ACMP_T::COFF: NCODE1 Position              */
#define ACMP_COFF_NCODE1_Msk            (0xfUL << ACMP_COFF_NCODE1_Pos)             /*!< ACMP_T::COFF: NCODE1 Mask                  */

#define ACMP_COFF_NSEL1_Pos             (23)                                        /*!< ACMP_T::COFF: NSEL1 Position               */
#define ACMP_COFF_NSEL1_Msk             (0x1UL << ACMP_COFF_NSEL1_Pos)              /*!< ACMP_T::COFF: NSEL1 Mask                   */

#define ACMP_COFF_PCODE1_Pos            (24)                                        /*!< ACMP_T::COFF: PCODE1 Position              */
#define ACMP_COFF_PCODE1_Msk            (0xfUL << ACMP_COFF_PCODE1_Pos)             /*!< ACMP_T::COFF: PCODE1 Mask                  */

#define ACMP_COFF_PSEL1_Pos             (31)                                        /*!< ACMP_T::COFF: PSEL1 Position               */
#define ACMP_COFF_PSEL1_Msk             (0x1UL << ACMP_COFF_PSEL1_Pos)              /*!< ACMP_T::COFF: PSEL1 Mask                   */

#define ACMP_TEST_CRV0TEST_Pos          (0)                                         /*!< ACMP_T::TEST: CRV0TEST Position            */
#define ACMP_TEST_CRV0TEST_Msk          (0x1UL << ACMP_TEST_CRV0TEST_Pos)           /*!< ACMP_T::TEST: CRV0TEST Mask                */

#define ACMP_TEST_CRV1TEST_Pos          (1)                                         /*!< ACMP_T::TEST: CRV1TEST Position            */
#define ACMP_TEST_CRV1TEST_Msk          (0x1UL << ACMP_TEST_CRV1TEST_Pos)           /*!< ACMP_T::TEST: CRV1TEST Mask                */

#define ACMP_TEST_OUTSEL0_Pos           (4)                                         /*!< ACMP_T::TEST: OUTSEL0 Position             */
#define ACMP_TEST_OUTSEL0_Msk           (0x1UL << ACMP_TEST_OUTSEL0_Pos)            /*!< ACMP_T::TEST: OUTSEL0 Mask                 */

#define ACMP_TEST_OUTSEL1_Pos           (5)                                         /*!< ACMP_T::TEST: OUTSEL1 Position             */
#define ACMP_TEST_OUTSEL1_Msk           (0x1UL << ACMP_TEST_OUTSEL1_Pos)            /*!< ACMP_T::TEST: OUTSEL1 Mask                 */

#define ACMP_TEST_OTEN0_Pos             (6)                                         /*!< ACMP_T::TEST: OTEN0 Position               */
#define ACMP_TEST_OTEN0_Msk             (0x1UL << ACMP_TEST_OTEN0_Pos)              /*!< ACMP_T::TEST: OTEN0 Mask                   */

#define ACMP_TEST_OTEN1_Pos             (7)                                         /*!< ACMP_T::TEST: OTEN1 Position               */
#define ACMP_TEST_OTEN1_Msk             (0x1UL << ACMP_TEST_OTEN1_Pos)              /*!< ACMP_T::TEST: OTEN1 Mask                   */

#define ACMP_TEST_HYSBYP0_Pos           (8)                                         /*!< ACMP_T::TEST: HYSBYP0 Position             */
#define ACMP_TEST_HYSBYP0_Msk           (0x1UL << ACMP_TEST_HYSBYP0_Pos)            /*!< ACMP_T::TEST: HYSBYP0 Mask                 */

#define ACMP_TEST_HYSBYP1_Pos           (9)                                         /*!< ACMP_T::TEST: HYSBYP1 Position             */
#define ACMP_TEST_HYSBYP1_Msk           (0x1UL << ACMP_TEST_HYSBYP1_Pos)            /*!< ACMP_T::TEST: HYSBYP1 Mask                 */

