wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/acmp_reg.h
#define ACMP_TEST_CCL0DIS_Pos           (12)                                        /*!< ACMP_T::TEST: CCL0DIS Position             */
#define ACMP_TEST_CCL0DIS_Msk           (0x1UL << ACMP_TEST_CCL0DIS_Pos)            /*!< ACMP_T::TEST: CCL0DIS Mask                 */

#define ACMP_TEST_CCL1DIS_Pos           (13)                                        /*!< ACMP_T::TEST: CCL1DIS Position             */
#define ACMP_TEST_CCL1DIS_Msk           (0x1UL << ACMP_TEST_CCL1DIS_Pos)            /*!< ACMP_T::TEST: CCL1DIS Mask                 */

#define ACMP_VERSION_MINOR_Pos          (0)                                         /*!< ACMP_T::VERSION: MINOR Position            */
#define ACMP_VERSION_MINOR_Msk          (0xffffUL << ACMP_VERSION_MINOR_Pos)        /*!< ACMP_T::VERSION: MINOR Mask                */

#define ACMP_VERSION_SUB_Pos            (16)                                        /*!< ACMP_T::VERSION: SUB Position              */
#define ACMP_VERSION_SUB_Msk            (0xffUL << ACMP_VERSION_SUB_Pos)            /*!< ACMP_T::VERSION: SUB Mask                  */

#define ACMP_VERSION_MAJOR_Pos          (24)                                        /*!< ACMP_T::VERSION: MAJOR Position            */
#define ACMP_VERSION_MAJOR_Msk          (0xffUL << ACMP_VERSION_MAJOR_Pos)          /*!< ACMP_T::VERSION: MAJOR Mask                */



/** @} ACMP_CONST */
/** @} end of ACMP register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

#endif /* __ACMP_REG_H__ */
